app/controllers/authors_controller.rb

INSERT INTO `authors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Brad', 'Tracy', '2015-08-12 23:53:27', '2015-08-12 23:53:27')
---
  def create
    @author = Author.new(author_params)
    if @author.save

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 6 LIMIT 1
UPDATE `authors` SET `last_name` = 'Marsh', `updated_at` = '2015-08-14 09:56:32' WHERE `authors`.`id` = 6
---
  def update
    @author = Author.find(params[:id])

    @author.update(author_params)

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 6 LIMIT 1
---
  def edit
    @author = Author.find(params[:id])

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 6 LIMIT 1
DELETE FROM `authors` WHERE `authors`.`id` = 6
---
  def destroy
    @author = Author.find(params[:id])

    @author.destroy

SELECT `authors`.* FROM `authors`
---
  def index
    @authors = Author.all