app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.save
---
INSERT INTO `books` (`title`, `category_id`, `author_id`, `publisher_id`, `isbn`, `price`, `buy`, `format`, `excerpt`, `pages`, `year`, `coverpath`, `created_at`, `updated_at`) VALUES ('The Long Error', 4, 1, 2, '225894561', '$19.95', 'link to buy', 'Digital', 'Alcatra cow ut fugiat, filet mignon kielbasa biltong quis velit esse. Rump jerky in ground round dolore, in kielbasa dolore minim andouille. Beef tenderloin nostrud, sausage alcatra dolore tri-tip. Aliqua tongue eu venison andouille tail occaecat picanha elit shank, ut salami pork chop. Et velit anim, culpa nostrud eu cupidatat adipisicing reprehenderit do turducken. Bresaola duis minim id shank fatback lorem incididunt esse kielbasa.', 456, '1945', 'covers/php_cookbook.jpg', '2015-08-14 09:12:05', '2015-08-14 09:12:05')

  def update
    @book = Book.find(params[:id])

    @book.update(book_params)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `title` = 'Beginning PHP 5 and MySQL: From Novice to Professional', `publisher_id` = 4, `isbn` = '978-1893115514', `price` = '$5.55', `buy` = 'http://www.amazon.com/Beginning-PHP-MySQL-Novice-Professional/dp/1893115518/ref=sr_1_4?ie=UTF8&qid=1439547192&sr=8-4&keywords=beginning+php+5', `excerpt` = 'btrd koju frsm pot demhoivftr thoiugh i ewoyld hdabkiug, btrd koju frsm pot demhoivftr thoiugh i ewoyld hdabkiug, btrd koju frsm pot demhoivftr thoiugh i ewoyld hdabkiug koju frsm pot demhoivftr thoiugh i ewoyld hdabkiug koju frsm pot demhoivftr thoiugh i ewoyld hdabkiug', `pages` = 800, `updated_at` = '2015-08-14 10:39:14' WHERE `books`.`id` = 3

  def destroy
    @book = Book.find(params[:id])

    @book.destroy
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 2

  def index
    @books = Book.all
    @categories = Category.all
---
SELECT `books`.* FROM `books`
SELECT `categories`.* FROM `categories`

  def show
    @book = Book.find(params[:id])
    @categories = Category.all
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`