app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('PHP', '2015-08-12 23:49:29', '2015-08-12 23:49:29')

   def update
    @category = Category.find(params[:id])

    @category.update(category_params)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'Ruby on Rails', `updated_at` = '2015-08-14 09:46:28' WHERE `categories`.`id` = 1

  def edit
    @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def destroy
    @category = Category.find(params[:id])

    @category.destroy
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 6 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 6

  def show
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`