app/controllers/publishers_controller.rb

INSERT INTO `publishers` (`name`, `created_at`, `updated_at`) VALUES ('Black Road Pubs', '2015-08-12 23:59:00', '2015-08-12 23:59:00')
---
  def create
    @publisher = Publisher.new(publisher_params)
    if @publisher.save

SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 2 LIMIT 1
UPDATE `publishers` SET `name` = 'Sonnington Street Doodles', `updated_at` = '2015-08-14 10:05:39' WHERE `publishers`.`id` = 2
---
  def update
    @publisher = Publisher.find(params[:id])

    @publisher.update(publisher_params)

SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 2 LIMIT 1
---
  def edit
    @publisher = Publisher.find(params[:id])

SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 3 LIMIT 1
DELETE FROM `publishers` WHERE `publishers`.`id` = 3
---
  def destroy
    @publisher = Publisher.find(params[:id])

    @publisher.destroy

SELECT `publishers`.* FROM `publishers`
---
  def index
    @publishers = Publisher.all